[
	{
		"date": "5 Apr 1098",
		"content": " Duke Włost paid a visit to King Bolesław in Kraków, bringing with him a tribute of 50 gold coins. King Bolesław was pleased with the tribute and assured Duke Włost that it would be used for the good of the kingdom. During their conversation, King Bolesław inquired about the situation in Upper Silesia and asked if there were any matters of concern or interest that he should be aware of. Throughout the conversation, King Bolesław's tone remained stern, but his face softened upon seeing Duke Włost kneel before him. He thanked Duke Włost for his loyalty and service to the kingdom."
	},
	{
		"date": "5 Apr 1098",
		"content": " Duke Włost visited King Bolesław's court to pay tribute and show his loyalty to the king. The duke handed over a chest containing 50 gold coins as a sign of respect and gratitude. King Bolesław was pleased with the gesture but acted modestly and thanked the duke for his loyalty and support, which he considered more valuable than any amount of gold. The king then asked about the situation in Upper Silesia, inquiring if Duke Włost was facing any troubles or unrest. Through this conversation, King Bolesław aimed to strengthen his relationship with Duke Włost, securing his loyalty and support in ruling the kingdom."
	},
	{
		"date": "5 Apr 1098",
		"content": " King Bolesław and Duke Włost, long-time friends, engage in a conversation where the formalities of their respective positions are set aside. King Bolesław insists that there is no need for such formality between them, given their history together. He recalls the victories and losses they have shared over the years and expresses his condolences regarding the recent passing of Duke Włost's mother. The two reminisce about their shared experiences, highlighting the strength of their friendship and their mutual resilience in the face of challenges. The conversation underscores the bond between the two men, their mutual respect, and their shared history."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław greeted Duke Włost and inquired about his well-being in Upper Silesia. The king congratulated the duke on his victory in the war against Jarosław's dethronement and expressed his happiness about the birth of the duke's sons, Bartosz and Włost. King Bolesław welcomed Duke Włost to take a seat and engage in conversation, setting a friendly and welcoming atmosphere. Throughout the conversation, the king showed interest in the duke's recent developments and expressed genuine happiness for his personal achievements."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław greeted Duke Włost and inquired about his well-being and the situation in Upper Silesia. He expressed his happiness over Duke Włost's recent victory against Jarosław Bodzęta and his successful resolution of the dethronement war without any bloodshed. King Bolesław also asked about Duke Włost's family, including his wife and children, and congratulated him on the birth of his new son. He then expressed his desire to sit down and catch up on old times with Duke Włost. The conversation was warm and friendly, with King Bolesław expressing genuine interest in Duke Włost's life and well-being."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław and Duke Włost discussed the ongoing conflict between their two kingdoms. The king expressed his desire for peace and a cessation of hostilities, while the duke remained hesitant and skeptical of the king's intentions. The king proposed a meeting between the two of them to discuss terms of a potential truce and to address the grievances of both sides. The duke agreed to consider the proposal, but expressed concern about the security of his own kingdom during the negotiations. The king assured the duke that he would take all necessary measures to ensure his safety and that of his people. Ultimately, the two leaders agreed to continue the conversation in order to reach a peaceful resolution to the conflict."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław and Duke Włost discussed the potential threat of a neighboring kingdom, with Duke Włost expressing concern about their growing power and possible intentions to invade. King Bolesław acknowledged the threat and shared his own intelligence on the matter, revealing that he had been keeping a close eye on the kingdom's movements. They agreed on the need to strengthen their own kingdom's defenses and to consider forming alliances with other neighboring kingdoms to counteract the potential threat. King Bolesław also suggested the possibility of sending a diplomatic envoy to the neighboring kingdom to gather more information and potentially negotiate a peaceful resolution. Duke Włost agreed to consider this option and thanked King Bolesław for his guidance and support."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław converses with Duke Włost, inquiring about his recent victory in the dethronement war and the well-being of his family, including his wife, Duchess Dobroniega, and sons, Bartosz and Włost. King Bolesław shares news of his own, announcing the birth of his first child, Czyrzniech, and expressing sadness over his mother's passing. They discuss Duke Włost's son, Bartosz, and King Bolesław expresses a desire to meet him. King Bolesław then inquires about the Duchy of Upper Silesia's well-being, asking about conflicts with nobles and any potential threats from the east. Through it all, King Bolesław reassures Duke Włost of his support and offers his help as Liege, ensuring the stability and prosperity of the duchy."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław warmly welcomes Duke Włost to his court after a long time. During their conversation, King Bolesław inquires about Duke Włost's well-being and his family. As they shake hands, King Bolesław acknowledges the two men standing behind Duke Włost, recognizing them as Sieciech Ciołek and Sieciech Topór, who were previously imprisoned by Duke Włost. King Bolesław's friendly demeanor and specific recognition of Duke Włost's associates indicate a deep familiarity and positive relationship between the two leaders, even after many years apart."
	},
	{
		"date": "19 Dec 1094",
		"content": " Duke Włost met with King Bolesław to discuss the progress on his castle's construction and seek his guidance on certain matters. King Bolesław commended Duke Włost on adding a chapel to the castle, but brought up an issue regarding disloyalty from some members of his court, specifically Sieciech Ciołek and Sieciech Topór who have been causing unrest and undermining his rule. King Bolesław suggested that the Duke address the issue promptly to prevent further discontent among his subjects. They also discussed the castle's roofing, with King Bolesław recommending slate tiles for their durability and protection against the elements. The conversation concluded with both leaders reaffirming their commitment to working together for the betterment of their territories and upholding their duty as just rulers for their people."
	},
	{
		"date": "19 Dec 1094",
		"content": " In the conversation, Duke Włost inquired about the progress of the construction of his castle from King Bolesław, who is overseeing the project. The King informed the Duke that the construction is going smoothly and is on schedule, with the foundation and walls already built. However, the Duke expressed concerns about the cost of the construction, and the King assured him that the expenses will be covered by the kingdom's treasury. The Duke also requested to incorporate a chapel into the castle's design, and the King agreed to the addition. The conversation concluded with the King reminding the Duke to make a decision about the type of roof for the castle, and the Duke agreed to provide his input soon."
	},
	{
		"date": "19 Dec 1094",
		"content": " Duke Włost greeted King Bolesław and started the conversation by discussing the current state of their kingdom. They talked about the recent battles and the need to strengthen their military forces. Duke Włost inquired about the possibility of recruiting more soldiers and acquiring advanced weaponry. King Bolesław assured him that the necessary measures would be taken and discussed the ongoing efforts to form alliances with neighboring kingdoms. They also briefly touched upon the importance of maintaining a stable economy and ensuring the welfare of their people. Overall, the conversation focused on the strategies to enhance the kingdom's military capabilities, establish alliances and maintain economic stability."
	},
	{
		"date": "19 Dec 1094",
		"content": " King Bolesław greeted Duke Włost and expressed his pride in his recent victory over Jarosław's rebellion and his capable leadership in Upper Silesia. He also congratulated him on the birth of his two sons, Bartosz and young Włost, and his recent marriage to Dobroniega. The king then shared his own news, including the birth of his son, Czyrzniech, and the passing of his mother, Dobronega Maria. Despite the sadness, King Bolesław encouraged them to celebrate their victories and prosperity, and invited Duke Włost to a feast in his honor that night. Overall, the conversation was a warm and friendly exchange between two allies, acknowledging each other's achievements and losses, and expressing their continued loyalty and camaraderie."
	}
]