[
	{
		"date": "1 Jan 1078",
		"content": "\nArechis, the Antiquarian and Acclaimed Knight, recently conversed with King Bolesław, his lord. During their conversation, Arechis described some of his personality traits, which included generosity, fickleness, and wrathfulness. Additionally, the two discussed the role of an antiquarian, which Arechis is. In his explanation, Arechis shared that he is a person with a strong interest and expertise in antiques and historical objects from the past. Additionally, Arechis shared that he is skilled in finding, identifying, and restoring old artifacts, books, and other historical objects."
	},
	{
		"date": "11 Jun 1078",
		"content": "\nArechis, the assistant, expresses surprise at the suggestion of friendship from King Bolesław, given their current situation. However, Arechis respects him as a ruler and a man and acknowledges that they share the same faith and culture. When King Bolesław confirms their friendship, Arechis is grateful but emphasizes their positions as ruler and prisoner and the consequences of their actions. He also thanks King Bolesław for any mercy and redemption that this friendship may bring, pledging his loyalty and asking for understanding and forgiveness in return. In short, Arechis acknowledges the unexpected nature of the friendship but embraces it, promising loyalty and respect while also acknowledging their different positions and the consequences of their actions."
	},
	{
		"date": "9 Jun 1078",
		"content": "\nArechis, a prisoner who has been serving as King Bolesław's advisor since their conflict in Płock, greeted his king and expressed his readiness to assist him. When asked about his purpose, he reminded the king of their agreement and his role as a counselor. When inquired if he desired release, Arechis requested freedom but also expressed a willingness to continue serving if necessary. He conveyed gratitude and requested an opportunity to redeem himself and regain respect if granted freedom. In response, King Bolesław contemplated and may consider his request."
	}
]