[
	{
		"date": "16 Jun 1077",
		"content": "\nQueen Wyszeslawa and King Bolesław engaged in a conversation where they discussed the recent tensions between their kingdoms. Queen Wyszeslawa expressed her concerns about the escalating conflicts, while King Bolesław acknowledged the issues and promised to work towards a peaceful resolution. They both agreed on the importance of maintaining good relations and ensuring the welfare of their people. The queen suggested a possible alliance through marriage between their families, which King Bolesław considerately agreed to think about. They parted ways with a shared commitment to fostering unity and resolving any disagreements amicably."
	},
	{
		"date": "16 Jun 1077",
		"content": "\nQueen Wyszeslawa and King Bolesław had a conversation where they discussed matters related to their kingdom. Queen Wyszeslawa expressed her thoughts on the current state of affairs, while King Bolesław provided his insights and suggested possible solutions to address the concerns raised. They both agreed to work together to ensure the prosperity and well-being of their people, reaffirming their commitment to each other and their kingdom."
	},
	{
		"date": "16 Jun 1077",
		"content": "\nQueen Wyszeslawa greets King Bolesław with joy and formality, expressing her delight at seeing him after a long absence. She inquires about his well-being and health, showing genuine concern for her husband's welfare. The queen stands tall, waiting for his response as they engage in a warm and affectionate conversation."
	},
	{
		"date": "16 Jun 1077",
		"content": "\nQueen Wyszeslawa greets King Bolesław with a curtsy, expressing her delight to see him after a long time. She inquires about his well-being, indicating a friendly and respectful relationship between them."
	},
	{
		"date": "3 Mar 1077",
		"content": "Queen Wyszeslawa greeted King Bolesław warmly, expressing her pleasure to see him again. She inquired about his well-being and reminded him of their last conversation, which took place the night before they sent away envoys to their neighbors. During that conversation, King Bolesław had expressed his concerns about the safety and well-being of the envoys on their long journey."
	},
	{
		"date": "19 Sep 1066",
		"content": "Queen Wyszeslawa greets her husband, King Bolesław II, with excitement and asks about his day. He replies with a brief \"yep,\" causing the queen to become concerned and inquire if everything is alright. She notices something seems off about him, and expresses her curiosity."
	},
	{
		"date": "19 Sep 1066",
		"content": "\nQueen Wyszeslawa greets King Bolesław as he enters their private bedchamber, but she notices that he seems tired and distracted. When she asks if something is wrong, he first asks where they are and then clarifies by asking which country they are in. Queen Wyszeslawa informs him that they are still in Kraków, in their castle within the Kingdom of Poland. She becomes concerned when King Bolesław continues to ask questions about their location, suggesting that there may be some confusion or memory loss on his part regarding their whereabouts."
	},
	{
		"date": "19 Sep 1066",
		"content": "Queen Wyszeslawa and King Bolesław greet each other in the castle's garden, appreciating the beautiful weather. Queen Wyszeslawa was searching for white lilies but hasn't found them yet. Later, King Bolesław asked her to tell about herself, so she introduced herself as Queen Wyszeslawa of Poland, wife of King Bolesław II 'the Bold'. She values honesty and is forgiving and patient by nature."
	},
	{
		"date": "15 Sep 1066",
		"content": "\nQueen Wyszeslawa greets her husband King Bolesław warmly and informs him that they are in their castle's garden. She points out the beautiful rose bushes and comments on the gardener's talent. When asked if she has seen the white lilies, Queen Wyszeslawa shares that she hasn't but is not concerned. She then asks King Bolesław what brings him to the garden, to which he responds that he wanted to see her. Queen Wyszeslawa expresses her joy at his surprise visit and suggests a horse ride through the woods together, which King Bolesław agrees to. Excitedly, she goes to prepare the horses for their ride."
	}
]