[
	{
		"date": "28 Sep 1066",
		"content": "\nIn the conversation, King Harold initially expressed a positive attitude, which made Queen Ældgyth happy and joyful. However, the conversation took a turn when King Harold slapped Queen Ældgyth on the face, causing her to feel shocked, betrayed, and hurt. Queen Ældgyth expressed her disappointment and anger towards King Harold's actions, stating that he had no right to raise a hand against her. Despite Queen Ældgyth's attempts to understand King Harold's behavior, he continued to slap her, resulting in her expressing her disbelief and anger towards him. The conversation ended with Queen Ældgyth walking away slowly with great dignity, leaving King Harold behind."
	},
	{
		"date": "28 Sep 1066",
		"content": "King Harold greeted Queen Ældgyth with a simple \"Hi\". In response, Queen Ældgyth gave him a warm smile and leaned in for a comforting hug while inquiring about his well-being. The conversation was cordial, and the queen expressed her happiness at King Harold's positive attitude. Overall, the interaction was a brief, friendly exchange between the king and queen."
	},
	{
		"date": "15 Sep 1066",
		"content": "\nKing Harold meets his wife, Queen Ældgyth, with enthusiasm, leaning into her welcoming kiss. She, in turn, greets him with a warm smile and a hand sanitizing gesture with wine alcohol. After the kiss, Queen Ældgyth notices her husband's tension, asking what might be troubling him. She expresses concern, hoping to learn what is preoccupying him, making him restless during their time together.\n```"
	},
	{
		"date": "15 Sep 1066",
		"content": "In this conversation, Queen Ældgyth and King Harold exchange friendly greetings, and Queen Ældgyth brings up the topic of sharing some rumors from the capital about their enemies attempting to claim the crown of England. She mentions two potential adversaries, one of which may involve Prince Wilhelm joining the conflict. Throughout their discussion, Queen Ældgyth refers to their pleasant surroundings in the castle's garden while entertaining her husband with more interesting tales from other territories. She also casually inquires about the possibility of having new servants to provide them with refreshments, as she expresses her enthusiasm for their conversations."
	}
]