[
	{
		"date": "13 Feb 1078",
		"content": " Twardomir, the devoted and dutiful heir of Count Tatomir, approached his father to discuss matters that required his attention. The topic of marriage arose, to which Twardomir expressed his openness to alliances that could strengthen their house and forge new ties. He mentioned his existing marriage to Lady Magdalena, a union born out of love rather than political strategy. Although Twardomir was open to a strategic marriage, he stated his commitment to upholding the honor of their house. Upon discovering that Twardomir was already married, Count Tatomir inquired whether he was aware of his existing marital status, to which Twardomir confirmed and reiterated his willingness to serve the interests of their house, trusting his father's judgment in these matters."
	},
	{
		"date": "13 Feb 1078",
		"content": " In the conversation, Twardomir respectfully greets Count Tatomir, his father and the ruler of Sandomierz. Twardomir identifies himself as a proud subject and knight of Sandomierz, expressing his loyalty and devotion to the Count. When asked by Count Tatomir if he is his father, Twardomir is taken aback but soon reveals his gratitude and admiration, acknowledging that the Count is not only his liege lord but also his father. He expresses his privilege in serving as both the Count's subject and eldest son and heir, emphasizing the wisdom and strength he has gained from his father's guidance."
	},
	{
		"date": "13 Feb 1078",
		"content": " Twardomir, the assistant, greeted Count Tatomir with a respectful bow and warm friendly tone, inquiring about his well-being on this fine morning. The Count, who seemed to be the user, responded to Twardomir's inquiry, implying that their conversation had been established and that Twardomir was serving as an assistant to the Count in some capacity. The tone of the conversation was respectful and cordial, with Twardomir showing genuine interest in the Count's well-being, further indicating their established relationship."
	}
]